app/controllers/statics_controller.rb

SELECT * FROM `statics` WHERE (stype = NULL)
---
  def index
    @statistics = Static.all