app/controllers/statics_controller.rb

SELECT * FROM `statics` WHERE (`statics`.`id` = 1)
---
  def show
    @static = Static.find(params[:id])

INSERT INTO `statics` (`updated_at`, `skey`, `stype`, `svalue`, `created_at`) VALUES('2010-05-03 07:50:09', '1956', 'graduates', '60', '2010-05-03 07:50:09')
---
  def create
    @static = Static.new(params[:static])

    respond_to do |format|
      if @static.save

SELECT * FROM `statics` WHERE (`statics`.`id` = 1)
DELETE FROM `statics` WHERE `id` = 1
---
  def destroy
    @static = Static.find(params[:id])
    @static.destroy